# CancellationListener Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CancellationListener Class
Members See Also
---
Allows clients to poll the cancellation status of a background operation. Revit instantiates CancellationListener objects for internal background operation implementations only. As such, third-party developers are not expected to instantiate or handle CancellationListener objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class CancellationListener : IDisposable
```

Visual Basic
---
```text
Public Class CancellationListener _
	Implements IDisposable
```

Visual C++
---
```text
public ref class CancellationListener : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CancellationListener
# See Also
CancellationListener Members
Autodesk.Revit.DB Namespace